package com.lance.game.module.attribute.model;

/**
 * 属性类型
 *
 * @author Lance
 * @since 2019/7/4 17:15
 */
public enum AttributeType {

    //--------------------------- 一级属性 ---------------------------
    // todo 力量、敏捷、智慧、体力 要有个机制可以级联计算


    //--------------------------- 二级属性 ---------------------------
    /** 最大血量 */
    HP_MAX,
    /** 血量 */
    HP,
    /** 最大蓝条 */
    MP_MAX,
    /** 蓝条 */
    MP,
    /** 攻击上限 */
    ATK_MAX,
    /** 攻击下限 */
    ATK_BASE,
    /** 最大防御 */
    DEFENCE,

    //--------------------------- 特殊属性 ---------------------------
    // todo 不归到上述范围的属性，如：金木水火土适应性
    ;


}
