package com.lance.game.demo.constant;

/**
 * 国际化id，命名规范：模块名+内容名（统一管理，以后方便维护）
 *
 * @author Lance
 */
public interface I18nId {

    /************************************* 通用 10000-11000 *************************************/
    int ERROR = 10000; // 发生未知错误
    int LEVEL_NOT_ENOUGH = 10001; // 等级不足
    int LEVEL_NOT_MATCH = 10002; // 等级不匹配

    /************************************* 道具 *************************************/
    int ITEM_NOT_EXIST = 20000; // 道具不存在
    int ITEM_CAN_NOT_USE = 20001; // 道具无法使用

    /************************************* 地图 *************************************/
    int WORLD_NOT_EXIST = 30000; // 地图不存在
    int WORLD_FULL_SCENE = 30000; // 场景已满员
}
